Autodesk.Revit.DB.Face.Project(Autodesk.Revit.DB.XYZ)
Projects the specified point on this face.
point: The point to be projected.
Returns: Geometric information if projection is successful;
if projection fails or the nearest point is outside of this face, returns null.
Remarks:
The following is the meaning of IntersectionResult's members:
XYZPoint is the nearest point to the projected point on the face.UVPoint is the UV coordinates of the nearest point on the face.Distance is the distance from the point to the face.EdgeObject is the edge if projected point is near an edge.EdgeParameter is the parameter of the nearest point on the edge.

Autodesk.Revit.DB.Face.IsInside(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.IntersectionResult@)
Indicates whether the specified point is within this face and outputs additional results.
point: The parameters to be evaluated, in natural parameterization of the face.
result: Provides more information when the point is on the edge; otherwise, null.
Returns: True if within this face, otherwise False.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the parameter evaluation fails.
Remarks:
The following is the meaning of the IntersectionResult members when the point is on the edge:
EdgeObject is the edge that the point lies on;
EdgeParameter is the parameter of the point on the edge nearest to the UV point;
UV is the specified point.

Autodesk.Revit.DB.Face.IsInside(Autodesk.Revit.DB.UV)
Indicates whether the specified point is within this face.
Indicates whether the specified point is within this face.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: True if point is within this face, otherwise false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the parameter evaluation fails.

Autodesk.Revit.DB.Face.ComputeNormal(Autodesk.Revit.DB.UV)
Returns the normal vector for the face at the given point.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: The normal vector. This vector will be normalized.
Remarks:
Differs from the normal returned from Autodesk.Revit.DB.Face.ComputeDerivatives(Autodesk.Revit.DB.UV) in that this vector is the "face normal" vector.
It will always be oriented to point out of the solid that contains the face.

Autodesk.Revit.DB.Face.ComputeDerivatives(Autodesk.Revit.DB.UV)
Returns the vectors describing the face at the specified point.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: The transformation containing tangent vectors and a normal vector.
Remarks:
The following is the meaning of the transformation members:
Origin is the point on the face (equivalent to Evaluate);BasisX is the tangent vector along the U coordinate (partial derivative with respect to U).BasisY is the tangent vector along the V coordinate (partial derivative with respect to V).BasisZ is the "surface normal" vector.  This is not necessarily the normal vector pointing out of the
solid that contains the face, to get that value use Autodesk.Revit.DB.Face.ComputeNormal(Autodesk.Revit.DB.UV).
None of the vectors are normalized.

Autodesk.Revit.DB.Face.Period(System.Int32)
The period of this face in the specified parametric direction.
paramIdx: Use 0 for u coordinate and 1 for v coordinate.
Returns: The real number equal to the period of this face.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an attempt is made to access the flag with an index larger than dimension.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this face is not cyclic in the specified direction.

Autodesk.Revit.DB.Face.IsCyclic(System.Int32)
The boolean value that indicates whether this face is periodic in the specified parametric direction.
paramIdx: Use 0 for u coordinate and 1 for v coordinate.
Returns: True if this face is cyclic; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an attempt is made to access the flag with an index larger than dimension.

Autodesk.Revit.DB.Face.Area
The area of this face.
Remarks:
Returns zero if fails to compute the area.
Estimates the area of this face by integrating tessellated edges.
Will slightly underestimate when the edges are curved.

Autodesk.Revit.DB.Face.Reference
Returns a stable reference to the face.

Autodesk.Revit.DB.Face.Evaluate(Autodesk.Revit.DB.UV)
Evaluates parameters on the face.
params: The parameters to be evaluated, in natural parameterization of the face.

Autodesk.Revit.DB.Face.IsTwoSided
Determines if a face is two-sided (degenerate)

Autodesk.Revit.DB.Face.MaterialElementId
Element ID of the material from which this face is composed.

Autodesk.Revit.DB.Face.GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
Remarks:
Orientations of the curves and curve loops match the orientations of the face's edges and edge loops.
The order of the CurveLoops should be considered as arbitrary.
Returns: A list of closed curve loops, that correspond edges of face.
Since: 2015

Autodesk.Revit.DB.Face.EdgeLoops
Each edge loop is a closed boundary of the face.

Autodesk.Revit.DB.Face.GetRegions
Face regions (created with the Split Face command) of the face.
Remarks: Use the FaceSplitter Class to filter and find these faces by type.
Returns: A list of faces, one for the main face of the object hosting the Split Face (such as wall of floor) and one face for each Split Face regions.

Autodesk.Revit.DB.Face.HasRegions
Reports if the face contains regions created with the Split Face command.

Autodesk.Revit.DB.Face
A face of a 3d solid.
Remarks: Faces are defined by surfaces bounded by edge loops. The surfaces provide
natural UV parameterization to the faces.